app/Http/Controllers/MainController.php

    public function index(ProductsFilterRequest $request)
    {
        $skusQuery = Sku::with(['product', 'product.category']);

        if ($request->filled('price_from')) {
            $skusQuery->where('price', '>=', $request->price_from);
        }

        if ($request->filled('price_to')) {
            $skusQuery->where('price', '<=', $request->price_to);
        }

        foreach (['hit', 'new', 'recommend'] as $field) {
            if ($request->has($field)) {
                $skusQuery->whereHas('product', function ($query) use ($field) {
                    $query->$field();
                });
            }
        }

        $skus = $skusQuery->paginate(6)->withPath("?".$request->getQueryString());
---
select * from `categories` where `categories`.`id` in (1)
select * from `products` where `products`.`id` in (1) and `products`.`deleted_at` is null
select * from `skus` where `skus`.`deleted_at` is null limit 6 offset 0
select count(*) as aggregate from `skus` where `skus`.`deleted_at` is null